{
  "Deep": {
    "categories": ["Deep Questions", "Late Night Talks", "For Best Friends", "Getting to Know", "For Siblings"],
    "categoryDetails": {
      "Deep Questions": {
        "description": "Questions that hit deep.",
        "emoji": "🎮",
        "questions": [
  "What memory always brings tears to your eyes, even if it's happy?",
  "If you could write a letter to your younger self, what would the first sentence be?",
  "What's one thing you wish you had said but never did?",
  "Have you ever felt completely understood by someone? What was that moment like?",
  "What's something you pretend to be okay with but secretly aren’t?",
  "What part of your personality do you hide from most people?",
  "When was the last time you truly felt at peace?",
  "What's a truth about yourself you're still learning to accept?",
  "What’s the loneliest moment you've ever had?",
  "What emotion do you run away from the most?",
  "What's something you envy in others but rarely admit?",
  "Who hurt you the most unintentionally? What did they do?",
  "What do you think is your most misunderstood trait?",
  "If you disappeared tomorrow, who would notice first?",
  "When do you feel most like yourself?",
  "Have you ever held back love because you were afraid it wouldn’t be returned?",
  "What version of you do you miss the most?",
  "When was the last time you felt truly brave?",
  "What’s a beautiful moment you never shared with anyone?",
  "What does forgiveness mean to you?",
  "What’s a part of your past you never talk about?",
  "What’s something you wish your parents had told you more often?",
  "What feeling are you chasing in life?",
  "Have you ever felt like giving up on everything? What stopped you?",
  "What belief did you grow up with that you no longer hold?",
  "What do you think people assume about you that’s completely wrong?",
  "If your walls could talk, what would they say about you?",
  "When was the last time you were truly proud of yourself?",
  "If someone could see your soul, what color would it be and why?",
  "What moment changed your view on love forever?",
  "What's something you've never fully healed from?",
  "What do you crave more than anything else in life?",
  "What’s the hardest truth you’ve had to accept about someone you love?",
  "What’s a dream you’ve quietly let go of?",
  "Who are you when no one’s watching?"
]
      },
      "Late Night Talks": {
        "description": "Get to knwo each other - for real.",
        "emoji": "🎬",
        "questions": [
          "What's the best movie you've seen this year?",
          "Which fictional character would you want as your best friend?",
          "What's a TV show you can watch over and over again?",
          "What concert would you time travel to attend?",
          "Who's your favorite fictional villain?"
        ]
      },
      "For Best Friends": {
        "description": "How well do you really know them?",
        "emoji": "⚽",
        "questions": [
          "What sport would you compete in if you were in the Olympics?",
          "What's your favorite sports memory?",
          "If you could be a professional athlete, which sport would you choose?",
          "What's the most extreme sport you'd try?",
          "Which team has the best fans?"
        ]
      },
      "Getting to Know": {
        "description": "Questions to meet someone new.",
        "emoji": "📱",
        "questions": [
          "What tech invention has impacted your life the most?",
          "If you had to give up all technology except one thing, what would you keep?",
          "What futuristic technology are you most excited about?",
          "What's your favorite app and why?",
          "Do you think robots will take over one day?"
        ]
      },
      "For Siblings": {
        "description": "Ask each other before it's too late.",
        "emoji": "🍔",
        "questions": [
          "What's your ultimate comfort food?",
          "What food combination do you love that others find strange?",
          "If you could master cooking one cuisine, which would it be?",
          "What's the most memorable meal you've ever had?",
          "Sweet or savory breakfast person?"
        ]
      }
    }
  },
  "Couple": {
    "categories": ["Couple Questions", "For Soulmates", "Couple Therapy", "For Long-Distance", "Favorite Questions"],
    "categoryDetails": {
      "Couple Questions": {
        "description": "Questions that will leave you feeling closer.",
        "emoji": "🧠",
        "questions": [
          "What's something you've never told anyone?",
          "When was the last time you changed your opinion about something major?",
          "What part of your life needs more attention right now?",
          "What would your younger self think of you today?",
          "What's the biggest risk you've ever taken?"
        ]
      },
      "For Soulmates": {
        "description": "Get real, vulnerable and - deepen your love.",
        "emoji": "💭",
        "questions": [
          "Do you believe in fate or do we create our own destiny?",
          "Is it better to be loved or respected?",
          "What makes someone a good person?",
          "Does true altruism exist?",
          "Is happiness a choice?"
        ]
      },
      "Couple Therapy": {
        "description": "Deep & rarely-asked questions. Meant to heal.",
        "emoji": "✨",
        "questions": [
          "What gives your life meaning?",
          "Do you believe in something greater than yourself?",
          "How do you find peace in difficult times?",
          "What's your relationship with spirituality?",
          "Do you think everything happens for a reason?"
        ]
      },
      "For Long-Distance": {
        "description": "Warning: this will make it difficult to hang up.",
        "emoji": "⚖️",
        "questions": [
          "Is it ever okay to lie?",
          "If you could change one problem in the world, what would it be?",
          "Do the ends justify the means?",
          "What's your strongest held belief?",
          "Is there such thing as objective right and wrong?"
        ]
      },
      "Favorite Questions": {
        "description": "Questions for every couple's favorite subject.",
        "emoji": "🔍",
        "questions": [
          "What's your biggest regret?",
          "What moment changed your life forever?",
          "What lesson took you the longest to learn?",
          "What would you tell your younger self?",
          "What's something you're still trying to prove to yourself?"
        ]
      }
    }
  },
  "Romantic": {
    "categories": ["Dating", "Relationships", "Intimacy", "Communication", "Future"],
    "categoryDetails": {
      "Dating": {
        "description": "Perfect for date night",
        "emoji": "❤️",
        "questions": [
          "What was your first impression of me?",
          "What's your idea of a perfect date?",
          "When did you know you had feelings for me?",
          "What's the most romantic gesture you've experienced?",
          "What's something you're afraid to tell me?"
        ]
      },
      "Relationships": {
        "description": "Strengthen your bond",
        "emoji": "💖",
        "questions": [
          "What makes you feel most loved?",
          "What's one thing you want me to work on in our relationship?",
          "What's your favorite memory of us?",
          "When do you feel closest to me?",
          "What's something I do that you appreciate but haven't told me about?"
        ]
      },
      "Intimacy": {
        "description": "Deepen your connection",
        "emoji": "💕",
        "questions": [
          "What do you find most attractive about me?",
          "What's something you've always wanted to try together?",
          "What makes you feel most connected to me?",
          "What's a fantasy you've never shared with me?",
          "How do you define intimacy beyond the physical?"
        ]
      },
      "Communication": {
        "description": "Improve how you talk and listen",
        "emoji": "💬",
        "questions": [
          "How do you prefer I bring up difficult topics?",
          "What's something you wish I understood better about you?",
          "How can I better support you when you're stressed?",
          "What's a boundary you need that you haven't expressed?",
          "What's your love language?"
        ]
      },
      "Future": {
        "description": "Plans and dreams together",
        "emoji": "🔮",
        "questions": [
          "Where do you see us in five years?",
          "What's something you want to achieve together?",
          "What kind of lifestyle do you want in the future?",
          "What are you most excited about for our future?",
          "What's one thing you want to make sure we never lose in our relationship?"
        ]
      }
    }
  }
}
