{
    "Deep": {
      "categories": ["Deep Questions", "Late Night Talks", "For Best Friends", "Getting to Know", "For Siblings"],
      "categoryDetails": {
        "Deep Questions": {
          "description": "Questions that hit deep.",
          "emoji": "✨",
          "questions": [
            "What belief about yourself have you been afraid to test?",
            "When did you first learn to hide parts of yourself to be loved?",
            "What’s a memory you’ve edited so many times you’re not sure what’s true?",
            "When did you realize survival and living are not the same thing?",
            "What apology do you owe yourself but still avoid giving?",
            "When did you betray your own boundaries to feel chosen?",
            "What’s a quiet fear that shapes your decisions more than you admit?",
            "When did you last forgive someone who never asked for it?",
            "What loss taught you the language of silence?",
            "When did pride keep you from asking for help you needed?",
            "What’s a dream you downsized to make your life hurt less?",
            "When did you stop telling the full truth to protect your image?",
            "What is your most dangerous comfort?",
            "When did you realize love can coexist with harm?",
            "What version of you still waits for closure that may never come?",
            "When did you feel seen and it scared you?",
            "What’s a lesson life repeated until you finally listened?",
            "When did you choose peace over being right, and why?",
            "What hunger in you has never been named out loud?",
            "When did you mistake numbness for healing?",
            "What boundary would protect you if you actually honored it?",
            "When did you become the person you once needed?",
            "What’s a truth you outgrew but keep performing anyway?",
            "When did you confuse attention with affection?",
            "What grief have you carried so long it feels like identity?",
            "When did you feel like hope was a risk you couldn’t afford?",
            "What do you cling to because letting go makes the past real?",
            "When did silence save you—and when did it cost you?",
            "What forgiveness would set you free if pride stepped aside?",
            "When did you meet a part of yourself you didn’t like—and stayed?",
            "What’s a promise you broke to yourself and still feel?",
            "When did you learn that being needed isn’t the same as being loved?",
            "What conversation with your younger self still feels urgent?",
            "When did you start settling—and what would it take to stop?",
            "What truth about you would end a performance you’re tired of maintaining?"
          ]
        },
        "Late Night Talks": {
          "description": "Get to know each other - for real.",
          "emoji": "🌙",
          "questions": [
            "What unasked question sits between you and sleep?",
            "When did the dark feel safer than the day?",
            "What confession lives in your drafts, never sent?",
            "When did quiet start sounding like judgment?",
            "What answer would change your life even if it hurt?",
            "When did you pretend you were fine so well you believed it?",
            "What truth do you only admit to the ceiling at 3am?",
            "When did trust die softly in you?",
            "What’s a tear you swallowed because no one could hold it?",
            "When do words fail you the most?",
            "What thought do you circle because you fear its center?",
            "When did reality feel like a story you couldn’t enter?",
            "What should someone have warned you about before life began?",
            "When did escape feel like the only honest plan?",
            "What dream felt like home until it didn’t?",
            "When did invisibility feel like relief?",
            "What wound became weather in you—always there, always changing?",
            "When did you realize joy requires surrender?",
            "What truth about love tastes sweet and bitter at once?",
            "When did you question whether your presence is a gift?",
            "What question keeps returning no matter how you answer it?",
            "When did the test become a teacher?",
            "What useful lie do you keep polished?",
            "When did guilt speak louder than facts?",
            "What moment taught you trust has an afterlife?",
            "When have your thoughts felt like a room with no doors?",
            "What fear do you keep busy to avoid meeting?",
            "When did belonging feel expensive?",
            "What truth hides behind your best jokes?",
            "When did you stop asking for permission to grow?",
            "What version of you went to bed and never woke up?",
            "When did you start measuring yourself by survival?",
            "What would you say if you weren’t afraid of being remembered for it?"
          ]
        },
        "For Best Friends": {
          "description": "How well do you really know them?",
          "emoji": "✌️",
          "questions": [
            "What truth about me do you protect even when I don’t deserve it?",
            "When did you recognize I was pretending and choose not to call me out?",
            "What do you know about my hurt that I still deny?",
            "When have my eyes told you a story my words refused to?",
            "What part of me do you treat gently because you know it bruises easily?",
            "When did you watch me perform strength and feel worried?",
            "What private war do you think I’m fighting?",
            "When did you feel me outgrow a version of myself?",
            "What about me remains a mystery you respect?",
            "When have you seen me love past wisdom?",
            "What decision of mine still changed me even if it was right?",
            "When have I carried weight you couldn’t lift for me?",
            "What fear of mine would you hold without fixing?",
            "When did I look most like myself to you?",
            "What regret do you think I keep rewriting?",
            "When did my confidence feel like camouflage?",
            "What moment of mine lives in your memory as if it happened to you?",
            "When have you seen me choose vulnerability over image?",
            "What do you think I’m still chasing from childhood?",
            "When did it hurt to witness me learn a necessary lesson?",
            "What do you admire in me that I keep minimizing?",
            "When did my silence worry you more than my crying would have?",
            "What truth about me would you never share without my consent?",
            "When did you know a chapter of my life had closed for good?",
            "What would you shield me from even if I asked you not to?",
            "When did you feel distance and choose to bridge it anyway?",
            "What choice of mine earned your respect forever?",
            "When did my weakness look like a different kind of strength?",
            "What do you think I grip so tightly because I’m afraid to be empty-handed?",
            "When did my childhood joy still shine through me?",
            "What hunger in me do you think will always remain?",
            "When did you see me break and build at the same time?",
            "What lesson do you wish I’d accept without self-punishment?",
            "When did I stand on the edge and you quietly stayed beside me?"
          ]
        },
        "Getting to Know": {
          "description": "Questions to meet someone new.",
          "emoji": "🧑‍🤝‍🧑",
          "questions": [
            "What chapter of your life do you rarely mention but shaped everything?",
            "When did you learn love without safety nets?",
            "What’s a boundary you wish you knew how to keep?",
            "When did disappearing seem easier than explaining?",
            "What truth about you takes courage to say out loud?",
            "When did control slip and you had to trust the fall?",
            "What regret matured into wisdom you actually use?",
            "When did the map fail and you trusted your feet instead?",
            "What moment do you forgive yourself for repeatedly?",
            "When did you realize costume and identity are not the same?",
            "What wound taught you to hold yourself differently?",
            "When did unfairness become your teacher?",
            "What truth has waited patiently for your attention?",
            "When did heartbreak reorganize your priorities?",
            "What question would make you both nervous and relieved to answer?",
            "When did failure become a doorway?",
            "What secret taught you the cost of silence?",
            "When did your openness feel like a holy risk?",
            "What decision still echoes in small ways daily?",
            "When did loneliness feel crowded?",
            "What sentence would you whisper to your past self right now?",
            "When did emotions flood faster than language?",
            "What mark do you carry that few people notice?",
            "When does your honesty become softer at night?",
            "What moment almost ended your story but didn’t?",
            "When did fear pretend to be logic?",
            "What experience made you fight to matter?",
            "When did secrecy feel like safety and then like prison?",
            "What unfairness do you now call reality—and should you?",
            "When would an eraser be tempting—and why would you decline it?",
            "What resistance in you is actually grief?",
            "When did you feel far from yourself and how did you come back?",
            "What promise to yourself do you want witnessed?"
          ]
        },
        "For Siblings": {
          "description": "Ask each other before it's too late.",
          "emoji": "🖤",
          "questions": [
            "What truth about our family do we both know but rarely admit?",
            "When did you feel like my protector even if I didn’t notice?",
            "What childhood moment do you think rewired me?",
            "When did my laughter sound most like freedom to you?",
            "What do you think I’m still unwilling to forgive?",
            "When did we function like a team without saying it?",
            "What secret of mine did you carry gently?",
            "When did my breaking point teach you something about me?",
            "What truth do you think I hide because it might change us?",
            "When did the house stop feeling like a playground?",
            "What hurt do you think I swallowed to keep peace?",
            "When did you feel me slipping away?",
            "What conversation do we keep postponing?",
            "When did my resilience impress you quietly?",
            "What inheritance from childhood do you think I still carry?",
            "When did I become someone you had to re-learn?",
            "What regret do you sense I carry heavily?",
            "When did we share a roof but feel like strangers?",
            "What from the past do you wish you could’ve blocked for me?",
            "When did my win feel like yours too?",
            "What about me remains confusing in a way you respect?",
            "When did my openness make you want to be braver?",
            "What moment do you think shaped my compass?",
            "When did distance feel safer than closeness for us?",
            "What do you think I keep gripping because it proves something?",
            "When did you notice me hiding pain behind jokes?",
            "What truth about us do we dodge to avoid changing?",
            "When did we rely on each other like lifelines?",
            "What about me would you defend even in my absence?",
            "When did you realize I bleed too?",
            "What impact of me on you have you never said aloud?",
            "When did I look fully alive to you?",
            "What broke me quietly that you wish I didn’t have to carry?",
            "When did you feel most accurately seen by me?"
          ]
        }
      }
    },
    "Couple": {
      "categories": ["Couple Questions", "For Soulmates", "Couple Therapy", "For Long-Distance", "Naughty Questions"],
      "categoryDetails": {
        "Couple Questions": {
          "description": "Questions that will leave you feeling closer.",
          "emoji": "💌",
          "questions": [
            "What part of me first felt like home to you—and why?",
            "When did our ordinary moment feel sacred?",
            "What small ritual of ours carries big meaning for you?",
            "When did my presence calm a storm in you?",
            "What do you wish I understood about how your love speaks?",
            "When did time feel too generous to us?",
            "What tiny habit of mine reminds you you’re loved?",
            "When did you exhale around me for the first time?",
            "What change in us surprised you in the best way?",
            "When did the world blur and only we stayed in focus?",
            "What detail about me do you secretly memorize?",
            "When did I shift from possibility to certainty?",
            "What unconscious cue from me softens you instantly?",
            "When did my love feel like an anchor, not a cage?",
            "What affirmation from me would land deepest right now?",
            "When did commitment stop feeling like a question?",
            "What name would you call me only in tenderness?",
            "When did growth between us feel visible?",
            "What memory of us do you keep for hard days?",
            "When did you choose us again, on purpose?",
            "What look from me says more than a paragraph?",
            "When did I advocate for you in a way you’ll never forget?",
            "What part of our story deserves to be retold?",
            "When did I feel like I understood your quiet?",
            "What have I taught you about being loved well?",
            "When did our chemistry feel like language?",
            "What gesture of mine always lands?",
            "When did you feel unmistakably chosen by me?",
            "What small thing melts you every single time?",
            "When did our foundation prove itself?",
            "What moment of us replays when you need hope?",
            "When did risk feel reasonable because it was for us?",
            "What makes our love distinctly ours?",
            "When did certainty about me settle into your bones?"
          ]
        },
        "For Soulmates": {
          "description": "Get real, vulnerable and - deepen your love.",
          "emoji": "💞",
          "questions": [
            "When did our timing feel orchestrated beyond us?",
            "What about me felt ancient the first week we met?",
            "When did our reflections show the same ache?",
            "What detail in me feels too aligned to dismiss as chance?",
            "When did the world send you a nod about us?",
            "What in you did my love heal without asking permission?",
            "When did our paths feel like threads braided long before?",
            "What about our bond feels outside of time?",
            "When did our silence become fluent?",
            "What sign keeps repeating when we’re together?",
            "When did destiny feel less like a word and more like a room?",
            "What quality in me feels like it was made for you?",
            "When did I feel familiar in a way that startled you?",
            "What in us defies explanation but needs none?",
            "When did our energy pull instead of push?",
            "What moment suspended the clock for us?",
            "When did I fill a shape you didn’t know was missing?",
            "What about me feels like returning home?",
            "When did something beyond logic nudge you toward me?",
            "What part of you softened under my care?",
            "When did depth stop being scary with me?",
            "What do I invite out of you that no one else can?",
            "When did words become optional between us?",
            "What dream do you imagine we were both handed?",
            "When did I feel like a shelter, not a shield?",
            "What in me feels marked for you?",
            "When did we transcend labels and simply were?",
            "What chapter in our story feels written already?",
            "When did our harmony sound undeniable?",
            "What in your heart expanded from loving me?",
            "When did two become one without losing either of us?",
            "What in me feels enduring across seasons?",
            "When do you sense we’ve done this before?",
            "What makes our love feel borderless?"
          ]
        },
        "Couple Therapy": {
          "description": "Deep & rarely-asked questions. Meant to heal.",
          "emoji": "🤍",
          "questions": [
            "When did my good intentions still miss you—and how can I learn?",
            "What fear about us do you hide to protect me?",
            "When did I drop the ball and not see the cost?",
            "What do I do that closes your heart, even a little?",
            "When did my attention feel borrowed, not given?",
            "What ground rules would make disagreements feel safer?",
            "When did my body stay while my presence left?",
            "What communication habit should we retire for good?",
            "When did love feel present but reassurance did not?",
            "What insecurity do I accidentally brush against?",
            "When did you wish I fought harder for repair?",
            "What topic do we tiptoe around that needs light?",
            "When did distance creep in quietly?",
            "What would increase your felt safety with me?",
            "When did your needs feel translated incorrectly by me?",
            "What cycle between us are you determined to end?",
            "When did my edges make loving me labor?",
            "What nourishment do you need more consistently from me?",
            "When did familiarity become taking you for granted?",
            "What truth about us is hard but helpful?",
            "When did reliability wobble—and how do we repair trust?",
            "What truth do you carry quietly to protect our peace?",
            "When did your pain feel invisible to me?",
            "What area of us needs steady tending, not quick fixes?",
            "When did you seek my pride and find my silence?",
            "What growth in us makes you believe we can do hard things?",
            "When did my support surprise you in a good way?",
            "What honesty would clear the air right now?",
            "When did my warmth dim—and how do we relight it?",
            "What practical change would strengthen our bond soonest?",
            "When did appreciation go unsaid and matter?",
            "What are you afraid could slip if we stop tending it?",
            "When did you still feel loved even in conflict?",
            "What new promise should we name and keep starting today?"
          ]
        },
        "For Long-Distance": {
          "description": "Warning: this will make it difficult to hang up.",
          "emoji": "📹",
          "questions": [
            "What’s the first ordinary thing you want to do together again?",
            "When did the missing ache in your body?",
            "What message from me became a talisman?",
            "When do you picture me so clearly it feels like touch?",
            "What moment today do you wish I had witnessed with you?",
            "When did love travel well across the miles?",
            "What struggle do you keep quiet to spare me worry?",
            "When does our reunion play like a movie in your mind?",
            "What truth have you held back until we’re face to face?",
            "When did closeness visit us through a screen?",
            "What memory of me guards your sleep?",
            "When did the distance feel heavy enough to name?",
            "What surprise would feel like a hug that lingers?",
            "When did the miles become our teacher?",
            "What ritual would stitch our days together from afar?",
            "When do thoughts of me press the hardest?",
            "What moment from our last call do you keep replaying?",
            "When did my comfort arrive without my knowing?",
            "What simple thing are you hungry to share again?",
            "When did I visit your dreams most vividly?",
            "What do you hide so I can rest easy?",
            "When did my patience feel like a gift?",
            "What keeps me near you in the mundane?",
            "When does loneliness echo the loudest?",
            "What scene do you imagine once the distance ends?",
            "When did your eyes sting missing me?",
            "What do you imagine about our first night back together?",
            "When were you proud of us for enduring?",
            "What do I do that lightens the miles?",
            "When did longing feel urgent?",
            "What whisper waits for in-person breath?",
            "When have you felt me close despite the map?",
            "What promise should we keep unbroken while apart?",
            "When did you decide the distance didn’t scare you off?"
          ]
        },
        "Naughty Questions": {
          "description": "Questions for every couple's favorite subject.",
          "emoji": "💋",
          "questions": [
            "What’s one thing I do that ruins your self-control instantly?",
            "When did wanting me feel deliciously inconvenient?",
            "What fantasy about us still lives unspoken?",
            "When did your mind undress me first?",
            "What words from me would undo you in a heartbeat?",
            "When would you want me to pin you and take the lead?",
            "What risky idea tempts you because it’s us?",
            "When did I make you feel shamelessly desired?",
            "What part of me do you crave with embarrassing honesty?",
            "When would you want me to set the pace and you follow?",
            "What was today’s most distracting thought about me?",
            "When did our chemistry feel like a spark catching fire?",
            "What do my hands do that short-circuits your thoughts?",
            "When have you pictured the thrill of almost getting caught?",
            "What kind of teasing would make you plead?",
            "When did your body answer me before your words did?",
            "What would you surrender to me without asking why?",
            "When would you want me to orchestrate everything?",
            "What roleplay would you actually enjoy with me?",
            "When did you imagine us stealing a moment in public?",
            "What sound from me flips a switch in you?",
            "When did you think, ‘I need them now’?",
            "What daring place tempts you because it’s forbidden?",
            "When did you picture me undressing you painfully slow?",
            "What bold thing would you say yes to tonight?",
            "When did our passion feel unstoppable and wild?",
            "What filthy thought about me visited you today?",
            "When did you imagine not sleeping at all with me?",
            "What fantasy would you want captured just for us?",
            "When would you want me to take your sight away?",
            "What could I do that would make you beg pretty?",
            "When did one thought of me make you blush?",
            "What do you want whispered against your neck?",
            "When did the heat between us feel undeniable?"
          ]
        }
      }
    },
    "Gossip": {
      "categories": ["Gossip Questions", "Truth or Dare", "Never Have I Ever", "Party Questions", "Spicy Questions"],
      "categoryDetails": {
        "Gossip Questions": {
          "description": "All the tea, right here.",
          "emoji": "☕",
          "questions": [
            "Who’s the last person you deep-scrolled and why?",
            "What rumor felt true because you wanted it to be?",
            "Who here do you trust with truth, not just secrets?",
            "What’s the pettiest hill you’ve died on socially?",
            "Who flirts as a shield more than a hobby?",
            "What lie of convenience are you most proud of escaping with?",
            "Who can’t resist lighting a small fire and watching it burn?",
            "What secret did you keep that changed a friendship?",
            "Who do you think would kiss first when no one’s looking?",
            "What DM would you unsend to save your peace?",
            "Who did you ghost because honesty felt harder?",
            "What rumor about you had a grain of truth?",
            "Who here leaks tea without realizing it’s boiling?",
            "What fight still replays in your head in different endings?",
            "Who is your crisis call before family?",
            "What petty lie turned into a big cleanup?",
            "Who thrives the most on being perceived?",
            "What oath did you break because silence got heavy?",
            "Who here would trade loyalty for attention?",
            "What crush would complicate life too much to admit?",
            "Who starts gossip under the disguise of concern?",
            "What secret about someone else scares you to hold?",
            "Who might date a friend’s ex and justify it well?",
            "What scandal did you overhear that changed how you see someone?",
            "Who lies beautifully—and dangerously?",
            "What rumor did you regret watering?",
            "Who here is permanently in your ‘never date’ folder?",
            "What secret about you do you think people already know?",
            "Who would you never hand your unlocked phone to?",
            "What secret dropped in your lap and made you uncomfortable?",
            "Who here treats gossip like a sport?",
            "What secret shocked you into silence?",
            "Who probably has the most chaotic dating lore?",
            "What story about someone do you wish you could unknow?"
          ]
        },
        "Truth or Dare": {
          "description": "Only fun if you play honestly.",
          "emoji": "🎲",
          "questions": [
            "Truth: What text did you wish you could recall the second you sent it?",
            "Dare: Hand your phone over and let someone search one word of their choice.",
            "Truth: Who did you flirt with recently that you hope no one noticed?",
            "Dare: Read your last voice note out loud.",
            "Truth: What date still makes you cringe in detail?",
            "Dare: Swap phones with the person on your right for 3 minutes.",
            "Truth: Who here do you low-key have a type-crush on?",
            "Dare: Send your crush a single dot and don’t explain for 10 minutes.",
            "Truth: What lie did you tell someone here to protect yourself?",
            "Dare: Show the last unposted photo in your camera roll.",
            "Truth: Who gave you the most disappointing kiss?",
            "Dare: Whisper the first flirty line that comes to mind to the person next to you.",
            "Truth: What song do you pretend to hate but love?",
            "Dare: Post a selfie with no filters or retakes.",
            "Truth: Who here would you avoid dating for everyone’s sake?",
            "Dare: Text someone “I miss you” and don’t reply for 5 minutes.",
            "Truth: What’s a lie you told in a past relationship and why?",
            "Dare: Let someone send one DM from your account (approved recipient).",
            "Truth: Who here could break hearts without trying?",
            "Dare: Call someone you like and ask them for a totally random opinion.",
            "Truth: What secret would change the vibe if said now?",
            "Dare: Change your display name to your ex’s initials for 10 minutes.",
            "Truth: Who here do you trust more than you admit?",
            "Dare: Show the last three emojis you used—and explain them.",
            "Truth: What’s your worst drunk judgment call?",
            "Dare: Send a flirty emoji to a random contact and show the reply.",
            "Truth: Who here would be chaos to date?",
            "Dare: Let the group choose a contact for you to voice note.",
            "Truth: What’s the pettiest jealous thing you’ve done?",
            "Dare: Post “I prefer honesty over harmony” on your story.",
            "Truth: Who’s the fakest ‘nice’ person you know?",
            "Dare: Share your last liked post and why you liked it.",
            "Truth: Who would you kiss right now if there were zero consequences?",
            "Dare: Let someone write your next post caption and you must use it."
          ]
        },
        "Never Have I Ever": {
          "description": "Raise your hand, if you dare.",
          "emoji": "🙋",
          "questions": [
            "Never have I ever kissed two people in one day.",
            "Never have I ever checked an ex’s profile from a burner.",
            "Never have I ever lied to a best friend’s face.",
            "Never have I ever hooked up with someone I shouldn’t have touched.",
            "Never have I ever held a secret that wasn’t mine to keep.",
            "Never have I ever dated someone just to spark jealousy.",
            "Never have I ever performed interest for attention.",
            "Never have I ever planted gossip to watch it travel.",
            "Never have I ever snooped through someone’s phone.",
            "Never have I ever crushed on someone sitting in this room.",
            "Never have I ever kissed a friend’s ex and kept it quiet.",
            "Never have I ever lied about my location to my parents.",
            "Never have I ever been caught bad-mouthing a friend.",
            "Never have I ever spread a rumor I knew was false.",
            "Never have I ever been blocked by someone I wanted.",
            "Never have I ever kissed someone I didn’t even like.",
            "Never have I ever been ghosted after acting like it didn’t matter.",
            "Never have I ever texted an ex in secret.",
            "Never have I ever lied during Truth or Dare.",
            "Never have I ever flirted at the absolute worst time.",
            "Never have I ever pretended to be someone else online.",
            "Never have I ever liked two people at once and entertained both.",
            "Never have I ever hidden a whole relationship.",
            "Never have I ever stirred drama just to feel alive.",
            "Never have I ever kissed someone at a party for applause.",
            "Never have I ever gone back to an ex and regretted it.",
            "Never have I ever been caught sneaking out at night.",
            "Never have I ever gone on a date with someone I met online.",
            "Never have I ever kissed someone whose name I barely knew.",
            "Never have I ever read someone’s messages without permission.",
            "Never have I ever lied to protect a friend’s mess.",
            "Never have I ever been blocked after saying my truth.",
            "Never have I ever had a crush on a teacher.",
            "Never have I ever gossiped about someone who could hear me."
          ]
        },
        "Party Questions": {
          "description": "For the boldest ones at the table.",
          "emoji": "🎉",
          "questions": [
            "Who here would start the dance circle without music?",
            "What’s the boldest thing you did at a party and owned it?",
            "Who would be politely escorted out first—and why?",
            "What drunk story has aged like fine comedy?",
            "Who here becomes a chaos butterfly after two drinks?",
            "What party moment felt like a movie scene?",
            "Who would you skip inviting next time for your own sanity?",
            "What hangover humbled you into retirement talk?",
            "Who flirts the hardest when the playlist slaps?",
            "What club moment made you question your life choices?",
            "Who here would you not trust as your safety buddy drunk?",
            "What single night cost you the most money?",
            "Who would black out the fastest on a ‘light’ night?",
            "What wild place did you wake up and wonder how?",
            "Who is undeniably the party’s heartbeat?",
            "What ridiculous dare actually happened?",
            "Who is elite at wing-people duties?",
            "What party move do you still regret a little?",
            "Who here would accidentally embarrass you loudly?",
            "What drunk text of yours belongs in a museum?",
            "Who might start a fight and somehow win the crowd?",
            "What hookup story still makes you wince?",
            "Who here would you call for a 2am rescue?",
            "What party tale would your parents ban you for?",
            "Who here should never touch the mixers?",
            "What dance did you witness that defied physics?",
            "Who loses their phone like it’s a hobby?",
            "What college party memory is now legend?",
            "Who would you draft as your party teammate?",
            "What reckless moment could’ve been a PSA?",
            "Who sings karaoke with terrifying confidence sober?",
            "What memory makes you cringe and laugh equally?",
            "Who here keeps secrets even when tipsy?",
            "What unexpected moment became the night’s headline?"
          ]
        },
        "Spicy Questions": {
          "description": "Turn up the heat with extra seductive questions.",
          "emoji": "🥵",
          "questions": [
            "Who here would send a text that changes the temperature of the room?",
            "What’s the boldest public flirt you’ve actually pulled off?",
            "Who would you kiss right now if cameras were off?",
            "What dream left you waking up flustered?",
            "Who here hides the wildest secret well?",
            "What fantasy have you never said out loud?",
            "Who would you meet for a private, no-questions-asked date?",
            "What daring thing did you try that surprised even you?",
            "Who here plays the long tease best?",
            "What instantly flips your attraction switch?",
            "Who here imagines boldly and probably delivers?",
            "What compliment left you thinking about it all day?",
            "Who would you allow to scroll your DMs for 30 seconds?",
            "What’s the most scandalous location you’ve gotten away with?",
            "Who here would you slow-dance with at 1am?",
            "What turn-on lives quietly in your head?",
            "Who here has a hidden adventurous streak?",
            "What fearless move did you make on a crush?",
            "Who here would you actually risk strip poker with?",
            "What flirty text do you wish you could take back?",
            "Who here talks and flirts like an art form?",
            "What secret of yours is attractive because it’s secret?",
            "Who here would you get stuck overnight with on purpose?",
            "What would you only do if doors were definitely closed?",
            "Who here would you trust with a lingering massage?",
            "What compliment makes you blush despite yourself?",
            "Who here carries the spiciest dating lore?",
            "What roleplay would you genuinely try once?",
            "Who here would you dare to kiss and accept the consequences?",
            "What have you wanted to try that still scares you a little?",
            "Who here would be unexpectedly legendary in bed?",
            "What fantasy accelerates your heartbeat?",
            "Who here would make the first bold move confidently?",
            "What’s the most seductive thing you’ve done on purpose?"
          ]
        }
      }
    }
  }
